
  <html>
   <head></head>
   <body>
    <div>
     
   <div><strong>1.</strong> Исполнитель Редактор получает на вход строку цифр и преобразовывает её. Редактор может выполнять две команды, в обеих командах v и w обозначают цепочки цифр.<br/><pre>1. заменить (v, w)<br/>2. нашлось (v)</pre>Первая команда заменяет в строке первое слева вхождение цепочки v на цепочку w, вторая проверяет, встречается ли цепочка v в строке исполнителя Редактор. Если она встречается, то команда возвращает логическое значение «истина», в противном случае возвращает значение «ложь». Дана программа для исполнителя Редактор: <br/><pre>НАЧАЛО<br/>  ПОКА нашлось(21)<br/>    заменить (21, 6)<br/>  КОНЕЦ ПОКА<br/>КОНЕЦ</pre>Исходная строка содержит десять единиц и некоторое количество двоек, других цифр нет, точный порядок расположения единиц и двоек неизвестен. После выполнения программы получилась строка с суммой цифр 50. Какое наименьшее количество двоек могло быть в исходной строке?</div>
  
   <div><strong>2.</strong> (А.А. Имаев) Исполнитель Редактор получает на вход строку цифр и преобразовывает её. Редактор может выполнять две команды, в обеих командах v и w обозначают цепочки символов. <br/><pre>1. заменить (v, w) <br/>2. нашлось (v)</pre>Первая команда заменяет в строке первое слева вхождение цепочки v на цепочку w. Если цепочки v в строке нет, эта команда не изменяет строку. Вторая команда проверяет, встречается ли цепочка v в строке исполнителя Редактор. <br/>Дана программа для исполнителя Редактор: <br/><pre>НАЧАЛО<br/>ПОКА нашлось (78) ИЛИ нашлось (7)<br/>  ЕСЛИ нашлось (788)<br/>    ТО заменить (78, 8887)<br/>    ИНАЧЕ заменить (7,8888)<br/>  КОНЕЦ ЕСЛИ<br/>КОНЕЦ ПОКА<br/>КОНЕЦ</pre>Какая строка получится в результате применения приведённой ниже программы к строке, состоящей  одной цифры 7 и 55 стоящих справа от неё цифр 8? В ответ, запишите, сколько цифр 8 будет в конечной строке.</div>
  
   <div><strong>3.</strong> Исполнитель Редактор получает на вход строку цифр и преобразовывает её. Редактор может выполнять две команды, в обеих командах v и w обозначают цепочки цифр.<br/><pre>1. заменить (v, w)<br/>2. нашлось (v)</pre>Первая команда заменяет в строке первое слева вхождение цепочки v на цепочку w. Если цепочки v в строке нет, эта команда не изменяет строку. Вторая команда проверяет, встречается ли цепочка v в строке исполнителя Редактор. Если она встречается, то команда возвращает логическое значение «истина», в противном случае возвращает значение «ложь». Дана программа для исполнителя Редактор: <br/><pre>НАЧАЛО<br/>  ПОКА нашлось (56) ИЛИ нашлось (3333)<br/>    заменить (56, 3)<br/>    заменить (3333, 3)<br/>  КОНЕЦ ПОКА<br/>КОНЕЦ</pre>Какая строка получится в результате применения приведённой ниже программы к строке, состоящей из 121 строки 563 (563563563…563)?</div>
  
   <div><strong>4.</strong> Значение выражения 12•7<sup>135</sup> + 11•7<sup>92</sup> – 63•7<sup>22</sup> + 17•7<sup>11</sup> + 157  записали в системе счисления с основанием 7. Сколько различных цифр содержится в этой записи?</div>
  
   <div><strong>5.</strong> (П. Волгин) ) Значение выражения 19<sup>81</sup> + 23<sup>709</sup> – 4 записали в системе счисления с основанием 9. Определите количество комбинаций цифр 8# в этой записи, где # – любая цифра от 1 до 7.</div>
  
   <div><strong>6.</strong> Сколько единиц в двоичной записи числа<br/><pre>  4<sup>2016</sup>  + 2<sup>2018</sup> – 8<sup>600</sup> + 6</pre></div>
  
   <div><strong>7.</strong> Укажите наименьшее целое значение А, при котором выражение<br/><p class="formula"> ( – y + 2x < A) ∨ (x > 15) ∨ (y > 28) </p>истинно для любых целых положительных значений x и y.</div>
  
   <div><strong>8.</strong> (А. Богданов) Для какого наибольшего целого неотрицательного числа А выражение<br/><p class="formula"> (2y + x ≠ 70) ∨ (x < y) ∨ (A < x) </p>тождественно истинно, т.е. принимает значение 1 при любых целых <b>неотрицательных</b> x и y?</div>
  
   <div><strong>9.</strong> Обозначим через ДЕЛ(n, m) утверждение «натуральное число n делится без остатка на натуральное число m». Для какого наименьшего натурального числа А формула<br/><p class="formula">  ДЕЛ(x,А) → (¬ДЕЛ(x,21) ∨ ДЕЛ(x,35))</p>тождественно истинна (то есть принимает значение 1 при любом натуральном значении переменной х)?</div>
  
   <div><strong>10.</strong> Алгоритм вычисления значения функции F(n), где n – натуральное число, задан следующими соотношениями:<br/><pre>F(n) = 2*n*n*n + n*n, при n > 25<br/>F(n) = F(n+2) + 2*F(n+3), при n ≤ 25<br/></pre>Определите сумму цифр значения F(2).</div>
  
   <div><strong>11.</strong> Определите наименьшее значение n, при котором сумма чисел, которые будут выведены при вызове F(n), будет больше 1000000. Запишите в ответе сначала найденное значение n, а затем через пробел – соответствующую сумму выведенных чисел.<br/><table class="code"><tr><th>Паскаль</th><th>Python</th><th>C++</th></tr><tr><td class="pre">procedure F(n: integer);<br/>begin<br/>  writeln(n+1);<br/>  if n > 1 then begin<br/>    writeln(2*n);<br/>    F(n-1);<br/>    F(n-3);<br/>  end;<br/>end;<br/></td><td class="pre">def F( n ):<br/>  print(n+1)<br/>  if n > 1:<br/>    print(2*n)<br/>    F(n-1)<br/>    F(n-3)<br/></td><td class="pre">void F( int n )<br/>{<br/>  cout << n+1 << endl;<br/>  if( n > 1 ) {<br/>    cout << 2*n << endl;<br/>    F(n-1);<br/>    F(n-3);<br/>    }<br/>}<br/></td></tr></table></div>
  
   <div><strong>12.</strong> (Д.Ф. Муфаззалов) Определите количество различных натуральных значений n таких, что значение F(n, 2) находится в диапазоне [100; 1000].<br/><table class="code"><tr><th>Паскаль</th><th>Python</th><th>C++</th></tr><tr><td class="pre">function F(n, m: <br/>  integer): integer;<br/>begin<br/> if m = 0 then <br/>   F:= 1 <br/> else <br/>   F:= n*F(n,m-1) <br/>end;<br/></td><td class="pre">def F(n,m):<br/> if m == 0: <br/>   d = 1<br/> else: <br/>   d = n*F(n, m-1)<br/> return d<br/></td><td class="pre">int F(int n, int m)<br/>{<br/>if( m == 0 )<br/>  return 1; <br/>else <br/>  return n*F(n, m-1);<br/>}<br/></td></tr></table></div>
  
   <div><strong>13.</strong> (В. Шубинкин) В файле <a href="https://kpolyakov.spb.ru/cms/files/ege-seq/17-1.txt">17-1.txt</a> содержится последовательность целых чисел. Элементы последовательности могут принимать целые значения от -10 000 до 10 000 включительно. Определите и запишите в ответе сначала количество элементов последовательности, которые больше предыдущего элемента, затем наименьший модуль разности чисел в паре среди всех таких пар. В данной задаче под парой подразумевается два идущих подряд элемента последовательности. Например, для последовательности 307; 36; 45; -27; -11; -6; 2; -16 ответом будет пара чисел: 4 и 5.</div>
  
   <div><strong>14.</strong> (П. Финкель) В файле <a href="https://kpolyakov.spb.ru/cms/files/ege-seq/17-199.txt">17-199.txt</a> содержится последовательность целых чисел, которые принимают значения от -10000 до 10000 включительно. Тройка идущих подряд чисел последовательности называется уникальной, если только второе из них является положительным трёхзначным нечётным числом. Определите количество уникальных троек чисел, а затем – максимальную из всех сумм таких троек.</div>
  
   <div><strong>15.</strong> (А. Брейк) В файле <a href="https://kpolyakov.spb.ru/cms/files/ege-seq/17-288.txt">17-288.txt</a> содержится последовательность целых чисел. Элементы последовательности могут принимать целые значения от -10 000 до 10 000 включительно. Запишите в ответе количество троек элементов последовательности, в которых семеричные записи всех чисел оканчиваются на разные цифры и хотя бы одно число отрицательно. Затем минимальную разность между максимальным и минимальным числами в таких тройках. В данной задаче под тройкой подразумевается три идущих подряд элемента последовательности.</div>
  
    </div>
   </body>
  </html>
 