from itertools import product

'''
1 Между населёнными пунктами A, B, C, D, E, F, Z построены дороги с односторонним
движением. В таблице указана протяжённость каждой дороги. Отсутствие числа в таблице
означает, что прямой дороги между пунктами нет. Например, из A в B есть дорога длиной 4
км, а из B в A дороги нет.
Курьеру требуется проехать из A в Z, посетив не менее 6
населённых пунктов. Пункты A и Z при подсчёте учитываются, два раза проходить через
один пункт нельзя. Какова наименьшая возможная длина маршрута курьера? В ответе
запишите натуральное число – длину минимального маршрута.
'''
### TODO: Ответ – 17


'''
2 Логическая функция F задаётся выражением (x → y) ∧ (y → z).
На рисунке приведён фрагмент таблицы истинности функции
F. Определите, какому столбцу таблицы истинности функции F соответствует каждая из
переменных x, y, z.
'''
### TODO: Ответ – zxy
##print('z x y f')
##for x, y, z in product([0, 1], repeat=3):
##    f = int((not x or y) and (not y or z))
##    if f:
##        print(z, x, y, f)

