"""
1. (А. Рогов) В файле 3-40.xls приведён фрагмент базы фрагмент базы данных «Города и страны»,
описывающей различные страны, города и языки. База данных состоит из трех таблиц. Таблица
«Страны» (код, название, континент, регион, площадь, год получения независимости, население,
ОПЖ – ожидаемая продолжительность жизни, ВНД – валовый национальный доход, предыдущее
значение ВНД, форма правления, идентификатор столицы). Таблица «Города» (идентификатор,
название, код страны, район, население). Таблица «Языки» (код языка, код страны, название, является
ли официальным, процент использования в стране). По некоторым значениям данных нет, в этом
случае в таблице внесено значение NULL. На рисунке приведена схема базы данных.
Используя информацию из приведённой базы данных,
определите среднее население стран Европы, в которых наиболее популярный официальный язык
используют менее 60% населения. В ответе укажите только целую часть получившегося числа.
"""
# # TODO: Ответ – 2129900


"""
2. (А. Рогов) В файле 3-40.xls приведён фрагмент базы фрагмент базы данных «Города и страны»,
описывающей различные страны, города и языки. База данных состоит из трех таблиц. Таблица
«Страны» (код, название, континент, регион, площадь, год получения независимости, население,
ОПЖ – ожидаемая продолжительность жизни, ВНД – валовый национальный доход, предыдущее
значение ВНД, форма правления, идентификатор столицы). Таблица «Города» (идентификатор,
название, код страны, район, население). Таблица «Языки» (код языка, код страны, название, является
ли официальным, процент использования в стране). По некоторым значениям данных нет, в этом
случае в таблице внесено значение NULL. На рисунке приведена схема базы данных.
Используя информацию из приведённой базы данных,
определите среднее значение населения стран у которых в столице проживает более 100000 человек,
но не более 500000.
"""
# # TODO: Ответ – 27679342


"""
3. В файле 3-0.xls приведён фрагмент базы данных «Продукты» о поставках товаров в магазины
районов города. База данных состоит из трёх таблиц. Таблица «Движение товаров» содержит записи о
поставках товаров в магазины в течение первой декады июня 2021 г., а также информацию о
проданных товарах. Поле Тип операции содержит значение Поступление или Продажа, а в
соответствующее поле Количество упаковок, шт. занесена информация о том, сколько упаковок
товара поступило в магазин или было продано в течение дня. Таблица «Товар» содержит информацию
об основных характеристиках каждого товара. Таблица «Магазин» содержит информацию о
местонахождении магазинов. На рисунке приведена схема указанной базы данных.
Используя информацию из приведённой базы
данных, определите общую стоимость (в рублях) товаров Мелькомбината, проданных за указанный
период в магазинах Октябрьского района.
"""
# # TODO: Ответ – 63325


"""
4. (А. Рогов) В файле 3-30.xls приведён фрагмент базы фрагмент базы данных «Русский рок»,
описывающей советские и российские рок-группы. База данных состоит из двух таблиц. Таблица
«Группы» содержит информацию о музыкальных коллективах: ID, название, год основания. Таблица
«Альбомы» содержит информацию о студийных музыкальных альбомах: ID, название, ID группы, год
издания, количество песен. Для каждой группы в базе данных указано ровно 3 альбома. На рисунке
приведена схема базы данных.
Используя информацию из приведённой базы данных,
определите ID группы, выпустившей альбом с минимальным количеством песен среди указанных в
базе данных.
"""
# # TODO: Ответ – 7


"""
5. В файле 3-78.xls приведён фрагмент базы данных «Продукты» о поставках товаров в магазины
районов города. База данных состоит из трёх таблиц. Таблица «Движение товаров» содержит записи о
поставках товаров в магазины в течение первой декады июня 2021 г., а также информацию о
проданных товарах. Поле Тип операции содержит значение Поступление или Продажа, а в
соответствующее поле Количество упаковок, шт. занесена информация о том, сколько упаковок
товара поступило в магазин или было продано в течение дня. Таблица «Товар» содержит информацию
об основных характеристиках каждого товара. Таблица «Магазин» содержит информацию о
местонахождении магазинов. На рисунке приведена схема указанной базы данных.
Используя информацию из приведённой базы
данных, определите на сколько увеличилось количество упаковок кофе всех сортов, имеющихся в
наличии в магазинах Заречного района, за период с 3 по 8 июня включительно.
"""
# # TODO: Ответ – 779


"""
6. Откройте файл электронной таблицы 9-0.xls, содержащей результаты ежечасного измерения
температуры воздуха на протяжении трёх месяцев. Найдите количество дней в апреле, когда
температура в 21:00 была ниже, чем средняя температура в этот день.
"""
# # TODO: Ответ – 24


"""
7. (М. Ишимов) В файле электронной таблицы 9-176.xls в каждой строке содержатся шесть
натуральных чисел. Определите количество строк таблицы, для которых выполнены оба условия:
– в строке есть хотя бы одно повторяющееся число;
– сумма неповторяющихся чисел строки нечётная.
"""
# # TODO: Ответ – 322


"""
8. Откройте файл электронной таблицы 9-0.xls, содержащей результаты ежечасного измерения
температуры воздуха на протяжении трёх месяцев. Определите дату в мае, когда с 07:00 до 8:00
зарегистрировано наибольшее увеличение температуры. В ответе введите только одно число – номер
дня. Если таких дней несколько, введите номер последнего такого дня.
"""
# # TODO: Ответ – 30


"""
9. Откройте файл электронной таблицы 9-0.xls, содержащей вещественные числа – результаты
ежечасного измерения температуры воздуха на протяжении трёх месяцев. Найдите разность между
максимальным и минимальным значениями температуры в июне. В ответе запишите только целую
часть получившегося числа.
"""
# # TODO: Ответ – 17


"""
10. Откройте файл электронной таблицы 9-0.xls, содержащей результаты ежечасного измерения
температуры воздуха на протяжении трёх месяцев. Найдите количество дней, когда температура в
08:00 была выше, чем средняя температура в этот день.
"""
# # TODO: Ответ – 30
